simpleFoam/campagneVerticalPosition/D050L474W090G001H200V020_C/system/simpleTemplate/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-3;//1e-2;
        U               1e-4;//1e-3;
        //"(k|epsilon|omega|f|v2)" 1e-3; 
    }
}

relaxationFactors
{
    fields
    {
        p   0.3;
        pFinal 1;
    }
    equations
    {
        "U|k|epsilon|omega"               0.7; // 0.9 is more stable but 0.95 more convergent
        "(U|k|epsilon|omega)Final"            1; // 0.9 is more stable but 0.95 more convergent
    }
    /*
    equations
    {
        U               0.9; // 0.9 is more stable but 0.95 more convergent
        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }
    */
}


// ************************************************************************* //
